app/controllers/posts_controller.rb

	def index
		@posts = Post.all # creating instance variable for presenting all posts
---
SELECT "posts".* FROM "posts"

	def show
		@post = Post.find(params[:id]) # creating instance variable for finding id for a certain post
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]